Autodesk.Revit.DB.CurveByPointsUtils.CreateArcThroughPoints(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ReferencePoint,Autodesk.Revit.DB.ReferencePoint,Autodesk.Revit.DB.ReferencePoint)
Creates an arc through the given reference points.
Remarks:
The interiorPoint determines the orientation of the arc while startPoint and endPoint determine
the angle parameters at the ends.
document:
The Document.
startPoint:
The start point of the arc.
endPoint:
The end end of the arc.
interiorPoint:
The interior point on the arc.
Returns:
The CurveElement to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Can't create an arc from the given points
Since:
2014

Autodesk.Revit.DB.CurveByPointsUtils.CreateRectangle(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ReferencePoint,Autodesk.Revit.DB.ReferencePoint,Autodesk.Revit.DB.CurveProjectionType,System.Boolean,System.Boolean,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId}@,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId}@)
Creates rectangle on face or sketchplane for two given diagonal points.
Remarks:
This array contains the ElementIds of the two additional corner points that are created to complete the rectangle.
document:
The Document.
startPoint:
First diagonal point of rectangle.
endPoint:
Second diagonal point of rectangle.
projectionType:
Projection type of rectangle's boundary curves.
If the rectangle input points are Face hosted, and CurveProjectionType::ParallelToLevel is requested,
and the Face normal at the location of the start point is at a less than 45 degree angle with the level
planes, then the projectionType will be set to FromTopDown, even if ParallelToLevel was requested.
boundaryReferenceLines:
True if rectangle's boundary curves should be reference lines, false otherwise.
boundaryCurvesFollowSurface:
True if rectangle's boundary curves should follow surface, false otherwise.
createdCurvesIds:
Created rectangle's boundary curves ids.
createdCornersIds:
Ids of two newly created corner points.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Unexpected projection type.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to create rectangle.
Since:
2012

Autodesk.Revit.DB.CurveByPointsUtils.GetFaceRegions(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Gets the FaceRegions in the existing face.
cda:
The Document.
referenceOfFace:
The Reference of the existing face.
Returns:
The FaceRegions in the existing face, or an empty collection if no FaceRegions are found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The Reference is not a Face Reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.CurveByPointsUtils.GetHostFace(Autodesk.Revit.DB.CurveElement)
Gets the host face to which the CurveElement is added.
curveElem:
The CurveElement.
Returns:
The host face to which the CurveElement is added, or an empty Reference if the host is not a face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input CurveElement is not a CurveByPoints.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.CurveByPointsUtils.AddCurvesToFaceRegion(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Adds The CurveElements to one or more FaceRegions.
Remarks:
The CurveElements that are input may produce an arbitrary number of regions.
document:
The Document.
curveElemIds:
The ElementIds of CurveElements which are to define the FaceRegion.
Throws Autodesk.Revit.Exceptions.ArgumentException:
All the input CurveElements must be CurveByPoints, with the sketchOnSurface attribute set to True, and for each CurveElement, the defining
ReferencePoints must be hosted on References related to a common Face or Edge.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to add curves to FaceRegion.
Since:
2012

Autodesk.Revit.DB.CurveByPointsUtils.ValidateCurveElementIdArrayForFaceRegions(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Validates that the input CurveElements can define FaceRegions.
The CurveElements must be CurveByPoints.  Each curve must be entirely hosted by a single Face or hosts related to a common
Face (for example, Edges of a common Face, other CurveElements hosted by a common Face). To be added to the FaceRegion definition,
a CurveElement must have the SketchOnSurface attribute set.
document:
The Document.
curveElemIds:
The CurveElements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.CurveByPointsUtils.SetSketchOnSurface(Autodesk.Revit.DB.CurveElement,System.Boolean)
Sets the relationship between the CurveElement and face.
curveElem:
The CurveElement.
sketchOnSurface:
Whether or not the CurveElement should lie on the face and be able to be added to the face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input CurveElement is not a CurveByPoints.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.CurveByPointsUtils.GetSketchOnSurface(Autodesk.Revit.DB.CurveElement)
Gets the relationship between the CurveElement and face.
curveElem:
The CurveElement.
Returns:
Whether or not the CurveElement should lie on the face and be able to be added to the face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input CurveElement is not a CurveByPoints.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.CurveByPointsUtils.SetProjectionType(Autodesk.Revit.DB.CurveElement,Autodesk.Revit.DB.CurveProjectionType)
Sets the projection type of the CurveElement.
curveElem:
The CurveElement.
value:
The input projection type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input CurveElement is not a CurveByPoints.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.CurveByPointsUtils.GetProjectionType(Autodesk.Revit.DB.CurveElement)
Gets the projection type of the CurveElement.
curveElem:
The CurveElement.
Returns:
The projection type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input CurveElement is not a CurveByPoints.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.CurveByPointsUtils.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CurveByPointsUtils
A static class that contains methods for processing curves driven by points.
Since:
2012